In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
technologies = [
            ("Spark", 22000,'30days',1000.0),
            ("PySpark",25000,'50days',2300.0),
            ("Hadoop",23000,'55days',1500.0)
            ]
df = pd.DataFrame(technologies,columns = ['Courses','Fee','Duration','Discount'])
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1500.0

In [3]:
df.head()

   Courses    Fee Duration  Discount
0    Spark  22000   30days    1000.0
1  PySpark  25000   50days    2300.0
2   Hadoop  23000   55days    1500.0

### Step 6: Display Top values for all numeric columns in DataFrame

In [4]:
from pandas.api.types import is_numeric_dtype

dfs = []

for col in df.columns:
    top_values = []
    if is_numeric_dtype(df[col]):
        top_values = df[col].nlargest(n=2)
        dfs.append(pd.DataFrame({col: top_values}).reset_index(drop=True))
        
pd.concat(dfs, axis=1)

     Fee  Discount
0  25000    2300.0
1  23000    1500.0

### 1. Quick Examples of Iterate Over Columns in Pandas DataFrame

In [5]:

# Use getitem ([]) to iterate over columns
for column in df:
    print(df[column])

0      Spark
1    PySpark
2     Hadoop
Name: Courses, dtype: object
0    22000
1    25000
2    23000
Name: Fee, dtype: int64
0    30days
1    50days
2    55days
Name: Duration, dtype: object
0    1000.0
1    2300.0
2    1500.0
Name: Discount, dtype: float64

In [6]:
# Use getitem ([]) to iterate over columns in pandas DataFrame
for column in df:
    print(df[column].values)

['Spark' 'PySpark' 'Hadoop']
[22000 25000 23000]
['30days' '50days' '55days']
[1000. 2300. 1500.]

### 3. Iterate Over Columns Using DataFrame.iteritems()

In [7]:

# Iterate over columns using DataFrame.iteritems()
for (colname,colval) in df.iteritems():
    print(colname, colval.values)

Courses ['Spark' 'PySpark' 'Hadoop']
Fee [22000 25000 23000]
Duration ['30days' '50days' '55days']
Discount [1000. 2300. 1500.]

In [8]:

# use iteritems()
for name, values in df.iteritems():
   print('{name}: {value}'.format(name=name, value=values[1]))

Courses: PySpark
Fee: 25000
Duration: 50days
Discount: 2300.0

### 4. Iterate Over Columns in DataFrame Using enumerate()

In [9]:

# iterate over columns in pandas DataFrame using enumerate()
for (index, colname) in enumerate(df):
    print(index, df[colname].values)

0 ['Spark' 'PySpark' 'Hadoop']
1 [22000 25000 23000]
2 ['30days' '50days' '55days']
3 [1000. 2300. 1500.]

In [10]:
# using enumerate()
for (index, column) in enumerate(df):
    print (index, df[column])

0 0      Spark
1    PySpark
2     Hadoop
Name: Courses, dtype: object
1 0    22000
1    25000
2    23000
Name: Fee, dtype: int64
2 0    30days
1    50days
2    55days
Name: Duration, dtype: object
3 0    1000.0
1    2300.0
2    1500.0
Name: Discount, dtype: float64

In [11]:
# using enumerate() & Numpy.asarray()
for (index, column) in enumerate(df):
    print (index, np.asarray(df[column]))

0 ['Spark' 'PySpark' 'Hadoop']
1 [22000 25000 23000]
2 ['30days' '50days' '55days']
3 [1000. 2300. 1500.]

### 5. Use DataFrame.columns() to Iterate Over Selected Columns

In [12]:

# Use DataFrame.columns()
for column in df.columns[1:]:
    print(df[column])

0    22000
1    25000
2    23000
Name: Fee, dtype: int64
0    30days
1    50days
2    55days
Name: Duration, dtype: object
0    1000.0
1    2300.0
2    1500.0
Name: Discount, dtype: float64

In [13]:
# Iterate over all the columns in reversed order    
for column in df.columns[::-1]:
    print(df[column])

0    1000.0
1    2300.0
2    1500.0
Name: Discount, dtype: float64
0    30days
1    50days
2    55days
Name: Duration, dtype: object
0    22000
1    25000
2    23000
Name: Fee, dtype: int64
0      Spark
1    PySpark
2     Hadoop
Name: Courses, dtype: object

In [14]:
# Get the indices of all columns
for indix, column in enumerate(df.columns):
    print(indix, column)

0 Courses
1 Fee
2 Duration
3 Discount

### 6. Use DataFrame.transpose().iterrows()

In [15]:
# Use DataFrame.transpose().iterrows()
for (column_name, column) in df.transpose().iterrows():
    print (column_name)

Courses
Fee
Duration
Discount

In [16]:
# Use DataFrame.transpose().iterrows()
for (column_name, column) in df.transpose().iterrows():
    print (column_name , column)

Courses 0      Spark
1    PySpark
2     Hadoop
Name: Courses, dtype: object
Fee 0    22000
1    25000
2    23000
Name: Fee, dtype: object
Duration 0    30days
1    50days
2    55days
Name: Duration, dtype: object
Discount 0    1000.0
1    2300.0
2    1500.0
Name: Discount, dtype: object